# categorical encoding: label encoing and one hot encoding

In [1]:
# adalah proses konversi nilai categorical menjadi nilai numerical
# jenis: label encoding & one hot encoding

In [3]:
# label encoding
# setiap kategori pada suatu feature akan diurutkan secara alfabet dan direpresentasikan dengan sebuah nilai integer

import pandas as pd

df= pd.DataFrame({'country': ['india', 'us', 'japan', 'us', 'japan'],
                  'age': [44,34,46,35,23],
                  'salary': [72000,65000,98000,45000,34000]})

df

  country  age  salary
0   india   44   72000
1      us   34   65000
2   japan   46   98000
3      us   35   45000
4   japan   23   34000

In [4]:
from sklearn.preprocessing import LabelEncoder

label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        0   44   72000
1        2   34   65000
2        1   46   98000
3        2   35   45000
4        1   23   34000

In [6]:
label_encoder.classes_

array(['india', 'japan', 'us'], dtype=object)

In [22]:
# one hot encoding
# setiap kategoru pada suatu feature akan diurutkan secara alfabet dan direpresentasikan sebagai kumpulan bits

df= pd.DataFrame({'country': ['india', 'us', 'japan', 'us', 'japan'],
                  'age': [44,34,46,35,23],
                  'salary': [72000,65000,98000,45000,34000]})

df

  country  age  salary
0   india   44   72000
1      us   34   65000
2   japan   46   98000
3      us   35   45000
4   japan   23   34000

In [23]:
x = df['country'].values.reshape(-1,1)
x

array([['india'],
       ['us'],
       ['japan'],
       ['us'],
       ['japan']], dtype=object)

In [24]:
from sklearn.preprocessing import OneHotEncoder

onehot_encoder = OneHotEncoder()
x= onehot_encoder.fit_transform(x).toarray()
x

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.]])

In [25]:
onehot_encoder.categories_

[array(['india', 'japan', 'us'], dtype=object)]

In [26]:
df_onehot = pd.DataFrame(x, columns=[str(i) for i in range (x.shape[1])])
df_onehot

     0    1    2
0  1.0  0.0  0.0
1  0.0  0.0  1.0
2  0.0  1.0  0.0
3  0.0  0.0  1.0
4  0.0  1.0  0.0

In [27]:
df = pd.concat([df_onehot, df], axis=1)
df

     0    1    2 country  age  salary
0  1.0  0.0  0.0   india   44   72000
1  0.0  0.0  1.0      us   34   65000
2  0.0  1.0  0.0   japan   46   98000
3  0.0  0.0  1.0      us   35   45000
4  0.0  1.0  0.0   japan   23   34000

In [28]:
df = df.drop(['country'], axis= 1)
df

     0    1    2  age  salary
0  1.0  0.0  0.0   44   72000
1  0.0  0.0  1.0   34   65000
2  0.0  1.0  0.0   46   98000
3  0.0  0.0  1.0   35   45000
4  0.0  1.0  0.0   23   34000

In [ ]:
# label encoding vs one hot encoding

# menerapkan one hot encoding bila:
#     nilai categorical adalah nominal
#     jumlah kategori tidak terlalu banyak

# menerapkan label encoding bila:
#     nilai categorical adalah ordinal
#     jumlah kategori yang ada relatif banyak